/*
SQLyog Community v13.1.9 (64 bit)
MySQL - 5.7.33 : Database - med_booking
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`med_booking` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `med_booking`;

/*Table structure for table `active_class` */

DROP TABLE IF EXISTS `active_class`;

CREATE TABLE `active_class` (
  `id_active` int(11) NOT NULL AUTO_INCREMENT,
  `medcode` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `building_id` int(11) DEFAULT NULL COMMENT 'ตึก',
  `class_no` int(11) DEFAULT NULL COMMENT 'ชั้น',
  `write` tinyint(1) DEFAULT '0' COMMENT 'เขียน',
  `read` tinyint(1) DEFAULT '1' COMMENT 'อ่าน',
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id_active`)
) ENGINE=MyISAM AUTO_INCREMENT=18 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `active_class` */

insert  into `active_class`(`id_active`,`medcode`,`building_id`,`class_no`,`write`,`read`,`created`) values 
(17,'BET0047',1,6,1,1,'2022-01-24 10:29:48');

/*Table structure for table `appm_section` */

DROP TABLE IF EXISTS `appm_section`;

CREATE TABLE `appm_section` (
  `SECTION_CODE` int(10) DEFAULT NULL,
  `section_ID` varchar(30) DEFAULT NULL,
  `DESCRIPTION` varchar(600) DEFAULT NULL,
  `LEVEL1` double DEFAULT NULL,
  `BRANCH_NO` double DEFAULT NULL,
  `GROUP_SECTION` varchar(60) DEFAULT NULL,
  `TYPE_SECTION` varchar(15) DEFAULT NULL,
  `FULL_ENAME` varchar(300) DEFAULT NULL,
  `ABBV_TNAME` varchar(300) DEFAULT NULL,
  `ABBV_ENAME` varchar(300) DEFAULT NULL,
  `USE_STATUS` double DEFAULT NULL,
  `COM_NO` varchar(60) DEFAULT NULL,
  `PROJECT_CODE` varchar(60) DEFAULT NULL,
  `DEPART` int(11) DEFAULT NULL,
  `DATE_UPDATE` date DEFAULT NULL,
  `USER_UPDATE` varchar(60) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `appm_section` */

insert  into `appm_section`(`SECTION_CODE`,`section_ID`,`DESCRIPTION`,`LEVEL1`,`BRANCH_NO`,`GROUP_SECTION`,`TYPE_SECTION`,`FULL_ENAME`,`ABBV_TNAME`,`ABBV_ENAME`,`USE_STATUS`,`COM_NO`,`PROJECT_CODE`,`DEPART`,`DATE_UPDATE`,`USER_UPDATE`) values 
(67,'KM','งานการจัดการความรู้',2,0,'01','03','knowledge Management',' ',' ',0,' ',' ',NULL,'2009-04-01','420006'),
(12,'SU','ภาควิชาศัลยศาสตร์',2,0,'01','03','Surgtery',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(68,'GA','รพ.ธรรมศาสตร์เฉลิมพระเกียรติ',1,1,' ','01','Thammasat University Hospital','รพ.มธ.',' ',0,' ',' ',NULL,'2005-05-31','BD01'),
(69,'ZT','ซ่อมบำรุง(รพธ.)',2,0,'01','05',' ',' ',' ',0,' ',' ',NULL,'2005-06-29','HR05'),
(62,'YA','วิจัยการแพทย์แผนไทย',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2005-07-18','HR05'),
(63,'ZE','วิจัยเภสัชวิทยาและพิษวิทยา',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2005-07-18','HR05'),
(64,'ZF','วิจัยเวชศาสตร์การเจริญพันธ์',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2005-07-18','HR05'),
(65,'ZG','วิจัยชีววิทยาระดับเซลล์และอณูชีววิทยา',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2005-07-18','HR05'),
(66,'ZP','โครงการศูนย์การแพทย์แผนไทยประยุกต์ (คูคต)',1,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2007-04-18','420006'),
(57,'ZH','ห้องปฏิบัติการวิจัย ชั้น 5',2,0,'01','03',' ',' ',' ',0,' ','95',NULL,'2008-09-29','420006'),
(58,'ZJ','ห้องปฏิบัติการวิจัย ชั้น 8',2,0,'01','03',' ',' ',' ',0,' ','95',NULL,'2008-09-29','420006'),
(59,'ZK','ห้องสัตว์ทดลอง',2,0,'01','03',' ',' ',' ',0,' ','95',NULL,'2008-09-29','420006'),
(1001,'ZL','ผู้มีความรู้ความสามารถพิเศษ',2,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2009-09-07','420006'),
(55,'ZM','งานวิจัยและบริการสังคม',2,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2004-11-26','HR02'),
(70,'ZO','ห้องสมุดกลุ่มแพทย์ธรรมศาสตร์',1,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2007-08-03','420006'),
(50,'PD','งานนโยบายและแผน',1,0,'01','03','Planning and Quality Development Office',' ',' ',1,' ',' ',NULL,'2008-03-20','420006'),
(42,'HR','งานบริหารทรัพยากรมนุษย์',1,0,'01','03','Human Resource Adminstration Office',' ',' ',1,' ',' ',NULL,'2008-03-20','420006'),
(43,'GA','งานบริหารทั่วไป',2,0,'01','04','General Administration Office',' ',' ',1,' ',' ',1005,'2008-04-04','420006'),
(25,'MM','สาขาอณูพันธุศาสตร์-อณูชีววิทยาการแพทย์',1,0,'01','03','Molecular genetics & Molecular biology in medicine',' ',' ',1,' ',' ',1003,'2009-02-19','420006'),
(26,'CB','สาขาเซลล์ชีววิทยา',1,0,'01','03','Cell Biology',' ',' ',1,' ',' ',1003,'2011-01-19','BHR0006'),
(1,'ZA','คณะแพทยศาสตร์',1,0,'01','01',' ',' ',' ',0,' ',' ',NULL,'2004-09-30','SLC108'),
(4,'DC','สถานวิทยาศาสตร์คลินิก',2,0,'01','02','Department of Clinical Science',' ',' ',1,' ',' ',1002,'2004-09-30','SLC108'),
(5,'IM','ภาควิชาอายุรศาสตร์',3,0,'01','03','Internal Medicine',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(6,'OB','ภาควิชาสูติศาสตร์-นรีเวชวิทยา',3,0,'01','03','Obstetrics & Gynecology',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(7,'PE','ภาควิชากุมารเวชศาสตร์',3,0,'01','03','Pediatraics',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(8,'OT','ภาควิชาออร์โธปิดิกส์',3,0,'01','03','Orthopedics',' ',' ',1,' ',' ',1002,'2016-09-08','BHR0004'),
(9,'OP','ภาควิชาจักษุวิทยา',3,0,'01','03','Ophthalmology',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(10,'RA','ภาควิชารังสีวิทยา',3,0,'01','03','Radiology',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(11,'PA','ภาควิชาพยาธิวิทยา',3,0,'01','03','Pathology',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(16,'OL','ภาควิชาโสต ศอ นาสิกวิทยา',3,0,'01','03','Otolarynogology',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(13,'ZN','สาขาโสต นาสิก ลาริงซ์วิทยา',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(14,'AN','ภาควิชาวิสัญญีวิทยา',3,0,'01','03','Anesthesiology',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(15,'RM','ภาควิชาเวชศาสตร์ฟื้นฟู',3,0,'01','03','Rehabilitation Medicine',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(17,'DP','สถานวิทยาศาสตร์พรีคลินิก',2,0,'01','02','Department of Preclinical Science',' ',' ',1,' ',' ',NULL,'2016-08-10','admin'),
(18,'PH','สาขาสรีรวิทยา',3,0,'01','03','Physicitogy',' ',' ',1,' ',' ',1003,'2004-10-11','SLC100'),
(19,'AT','สาขากายวิภาคศาสตร์',3,0,'01','03','Anatomy',' ',' ',1,' ',' ',1003,'2004-10-11','SLC100'),
(20,'BC','สาขาชีวเคมี',3,0,'01','03','Biochemistry',' ',' ',1,' ',' ',1003,'2004-10-11','SLC100'),
(21,'MI','สาขาจุลชีววิทยาและภูมิคุ้มกันวิทยา',3,0,'01','03','Micrology&Immunology',' ',' ',1,' ',' ',1003,'2004-10-11','SLC100'),
(22,'PR','สาขาปรสิตวิทยา',3,0,'01','03','Parasitology',' ',' ',1,' ',' ',1003,'2004-10-11','SLC100'),
(23,'PM','สาขาเภสัชวิทยา',3,0,'01','03','Pharmacology',' ',' ',1,' ',' ',1003,'2004-10-11','SLC100'),
(24,'ZI','สาขาภูมิคุ้มกันวิทยา',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(27,'CF','สถานเวชศาสตร์ชุมชนและเวชศาสตร์ครอบครัว',2,0,'01','02','Community Medicine and Family Medicine',' ',' ',1,' ',' ',NULL,'2014-08-14','admin'),
(28,'CF','สาขาเวชศาสตร์ชุมชน',3,0,'01','03','Department of Community Medicine and Family Medicine',' ',' ',1,' ',' ',1004,'2004-10-11','SLC100'),
(29,'CF','สาขาเวชศาสตร์ครอบครัว',3,0,'01','03','Family Physician',' ',' ',1,' ',' ',1004,'2004-10-11','SLC100'),
(30,'EM','ภาควิชาเวชศาสตร์ฉุกเฉิน',3,0,'01','03','Emergency Medicine',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(31,'PS','ภาควิชาจิตเวชศาสตร์',3,0,'01','03','Psychiatry',' ',' ',1,' ',' ',1002,'2014-08-14','admin'),
(32,'TM','สถานการแพทย์แผนไทยประยุกต์',3,0,'01','03','Thai Traditional Medicine Office',' ',' ',1,' ',' ',1007,'2004-10-11','SLC100'),
(33,'CF','สาขาเทคโนโลยีทางการศึกษา',3,0,'01','03','Educational Technology Office',' ',' ',0,' ',' ',1004,'2004-10-11','SLC100'),
(34,'ES','งานบัณฑิตศึกษา',2,0,'01','02','Graduate Studies',' ',' ',1,' ',' ',1006,'2015-08-05','admin'),
(35,'ZC','สำนักงานเลขานุการ',2,0,'01','02',' ',' ',' ',0,' ',' ',NULL,'2004-09-30','SLC108'),
(36,'ZB','งานบริหารและแผน',3,0,'01','03',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(37,'ZQ','การเจ้าหน้าที่',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(38,'ZR','สารบรรณ',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(39,'ZX','วิเทศสัมพันธ์',4,0,'01','04','International Relations',' ',' ',0,' ',' ',1005,'2004-10-11','SLC100'),
(40,'YC','ประชาสัมพันธ์',4,0,'01','04',' ',' ',' ',0,' ',' ',1005,'2004-10-11','SLC100'),
(41,'YB','ประชุมและพิธีการ',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(44,'FP','งานคลังและพัสดุ',3,0,'01','03','Finalce and Procurement Office',' ',' ',1,' ',' ',NULL,'2004-10-11','SLC100'),
(45,'ZY','การเงินและบัญชี',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2020-08-03','admin'),
(46,'ZW','พัสดุ',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(47,'ZV','อาคารสถานที่',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(48,'ZU','ยานยนต์',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(51,'ES','งานบริการการศึกษา',3,0,'01','03','Educational Services Office/Academic Service Offic',' ',' ',1,' ',' ',1006,'2004-10-11','SLC100'),
(52,'ZS','ศึกษาศาสตร์',4,0,'01','04',' ',' ',' ',0,' ',' ',NULL,'2004-10-11','SLC100'),
(56,'RS','งานบริหารการวิจัย',3,0,'01','04','Research Office',' ',' ',1,' ','0205010',NULL,'2005-02-07','HR02'),
(54,'ET','งานเทคโนโลยีทางการศึกษา',3,0,'01','03','Educational Technology',' ',' ',1,' ',' ',NULL,'2004-10-11','SLC100'),
(60,'SS','งานบริการสังคม',3,0,'01','04','Social Service Office',' ',' ',1,' ',' ',NULL,'2011-05-02','BHR0006'),
(61,'SS','ศูนย์การแพทย์ธรรมศาสตร์คูคต',3,0,'01','04','Medical Center of Thammasat Khukhot',' ',' ',1,' ',' ',NULL,'2022-02-08','BHR0004'),
(53,'SA','งานกิจการนักศึกษา',4,0,'01','04','Student Affairs Office',' ',' ',1,' ',' ',NULL,'2005-02-09','HR02'),
(1011,'QA','งานพัฒนาคุณภาพ',NULL,0,'1','3','Quality Assurance','','',1,'','',1006,'2012-04-24','BHR0006'),
(1012,'EP','ภาควิชาระบาดวิทยาคลินิก',NULL,0,'1','3','Clinical Epidemiology','','EP',1,'','',1002,'2018-12-03','3459900203641'),
(1013,'RC','ศูนย์วิจัยทางคลินิก',NULL,0,'1','3','Clinical Rerearch Center','','',1,'','',NULL,'2020-09-09','admin'),
(1014,'FR','ภาควิชานิติเวชศาสตร์',NULL,0,'1','2','Forensic Medicine','','',1,'','',NULL,'2022-02-14','admin');

/*Table structure for table `building` */

DROP TABLE IF EXISTS `building`;

CREATE TABLE `building` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `building_name` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=9 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `building` */

insert  into `building`(`id`,`building_name`,`create_date`) values 
(1,'คุณากร','2020-11-17 09:09:22'),
(8,'ราชสุดา','2022-01-18 13:58:46');

/*Table structure for table `category` */

DROP TABLE IF EXISTS `category`;

CREATE TABLE `category` (
  `type` varchar(20) COLLATE utf8_unicode_ci NOT NULL,
  `category_id` int(11) DEFAULT '0',
  `topic` varchar(128) COLLATE utf8_unicode_ci NOT NULL,
  `published` tinyint(1) NOT NULL DEFAULT '1',
  KEY `type` (`type`),
  KEY `category_id` (`category_id`)
) ENGINE=MyISAM AUTO_INCREMENT=10 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `category` */

insert  into `category`(`type`,`category_id`,`topic`,`published`) values 
('accessories',3,'เครื่องคอมพิวเตอร์',1),
('accessories',4,'ไมค์',1),
('use',3,'ประชุม',1),
('accessories',6,'เครื่องดื่ม',1),
('use',6,'เรียน',1),
('accessories',8,'จอโปเจ็คเตอร์',1),
('accessories',7,'อาหารว่าง',1),
('use',7,'สอนออนไลน์',1),
('use',8,'จัดสอบ',1),
('use',9,'อัดเสียง',1),
('use',10,'ถ่ายภาพ',1),
('use',11,'อบรม',1),
('use',12,'จัดสัมนา',1);

/*Table structure for table `class` */

DROP TABLE IF EXISTS `class`;

CREATE TABLE `class` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `building_id` int(11) DEFAULT NULL COMMENT 'ไอดีตึก',
  `class_no` int(11) DEFAULT NULL COMMENT 'ไอดีชั้น',
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=38 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `class` */

insert  into `class`(`id`,`building_id`,`class_no`,`create_date`) values 
(36,1,6,'2020-12-25 09:45:20'),
(37,8,1,'2022-01-18 13:58:54');

/*Table structure for table `intendant` */

DROP TABLE IF EXISTS `intendant`;

CREATE TABLE `intendant` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `res_id` int(11) DEFAULT NULL COMMENT 'รหัสจองห้อง',
  `FULLNAME` varchar(255) DEFAULT NULL COMMENT 'ชื่อเจ้าหน้าที่ผู้ดูแล',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `intendant` */

/*Table structure for table `log` */

DROP TABLE IF EXISTS `log`;

CREATE TABLE `log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `medcode` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `stats` tinyint(1) DEFAULT NULL COMMENT '1 = login , 0 = logout',
  `timestamp` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=399 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `log` */

insert  into `log`(`id`,`medcode`,`stats`,`timestamp`) values 
(37,'BET0047',1,'2020-12-23 11:43:48'),
(38,'BET0047',0,'2020-12-23 13:32:45'),
(39,'BET0047',1,'2020-12-23 13:32:49'),
(40,'BET0047',0,'2020-12-23 14:02:34'),
(41,'ADMIN',1,'2020-12-23 14:03:56'),
(42,'ADMIN',0,'2020-12-23 14:09:33'),
(43,'ADMIN',1,'2020-12-23 14:12:35'),
(44,'ADMIN',1,'2020-12-23 14:13:00'),
(45,'ADMIN',1,'2020-12-24 09:42:37'),
(46,'ADMIN',1,'2020-12-25 08:55:49'),
(47,'ADMIN',1,'2020-12-25 09:27:59'),
(48,'ADMIN',1,'2020-12-28 09:53:38'),
(49,'ADMIN',1,'2020-12-28 10:18:01'),
(50,'',1,'2020-12-28 15:04:57'),
(51,'BET0047',1,'2020-12-28 15:05:18'),
(52,'BET0047',1,'2020-12-28 15:06:27'),
(53,'BET0047',1,'2020-12-28 15:11:09'),
(54,'',1,'2020-12-28 15:20:09'),
(55,'',1,'2020-12-28 15:20:16'),
(56,'',1,'2020-12-28 15:20:35'),
(57,'',1,'2020-12-28 15:21:02'),
(58,'',1,'2020-12-28 15:21:07'),
(59,'',1,'2020-12-28 15:21:22'),
(60,'',1,'2020-12-28 15:21:26'),
(61,'',1,'2020-12-28 15:21:37'),
(62,'BET0047',1,'2020-12-28 15:22:48'),
(63,'BET0047',1,'2020-12-28 15:22:55'),
(64,'BET0047',1,'2020-12-28 15:23:03'),
(65,'BET0047',1,'2020-12-28 15:25:39'),
(66,'BET0047',1,'2020-12-28 15:26:17'),
(67,'BET0047',1,'2020-12-28 15:26:52'),
(68,'BET0047',1,'2020-12-28 15:27:08'),
(69,'BET0047',1,'2020-12-28 15:27:11'),
(70,'BET0047',1,'2020-12-28 15:27:14'),
(71,'BET0047',1,'2020-12-28 15:27:15'),
(72,'BET0047',1,'2020-12-28 15:27:15'),
(73,'BET0047',1,'2020-12-28 15:27:15'),
(74,'BET0047',1,'2020-12-28 15:27:16'),
(75,'BET0047',1,'2020-12-28 15:27:16'),
(76,'BET0047',1,'2020-12-28 15:27:17'),
(77,'BET0047',1,'2020-12-28 15:27:25'),
(78,'BET0047',1,'2020-12-28 15:28:27'),
(79,'',0,'2020-12-28 15:31:49'),
(80,'BET0047',1,'2020-12-28 15:32:04'),
(81,'',0,'2020-12-28 15:32:05'),
(82,'BET0047',1,'2020-12-28 15:32:55'),
(83,'',0,'2020-12-28 15:32:56'),
(84,'BET0047',1,'2020-12-28 15:33:39'),
(85,'',0,'2020-12-28 15:33:40'),
(86,'BET0047',1,'2020-12-28 15:33:50'),
(87,'BET0047',1,'2020-12-28 15:34:16'),
(88,'',0,'2020-12-28 15:34:57'),
(89,'',1,'2020-12-28 15:35:38'),
(90,'',1,'2020-12-28 15:35:39'),
(91,'',1,'2020-12-28 15:36:23'),
(92,'',1,'2020-12-28 15:36:45'),
(93,'',1,'2020-12-28 15:36:51'),
(94,'',1,'2020-12-28 15:38:44'),
(95,'',1,'2020-12-28 15:39:28'),
(96,'ADMIN',1,'2020-12-28 15:40:18'),
(97,'ADMIN',0,'2020-12-28 15:40:34'),
(98,'BET0047',1,'2020-12-28 15:42:19'),
(99,'',0,'2020-12-28 15:42:21'),
(100,'ADMIN',1,'2020-12-28 15:42:33'),
(101,'ADMIN',0,'2020-12-28 15:42:35'),
(102,'ADMIN',1,'2020-12-28 15:44:12'),
(103,'ADMIN',0,'2020-12-28 15:44:53'),
(104,'ADMIN',1,'2020-12-28 15:44:57'),
(105,'ADMIN',0,'2020-12-28 15:45:23'),
(106,'BET0047',1,'2020-12-28 15:53:35'),
(107,'',0,'2020-12-28 16:01:10'),
(108,'ADMIN',1,'2020-12-28 16:01:18'),
(109,'',1,'2020-12-28 16:02:17'),
(110,'ADMIN',1,'2020-12-28 16:02:46'),
(111,'',1,'2020-12-29 09:42:03'),
(112,'',1,'2020-12-29 09:42:11'),
(113,'BET0047',1,'2020-12-29 09:48:30'),
(114,'BET0047',1,'2020-12-29 09:49:09'),
(115,'BET0047',1,'2020-12-29 09:49:10'),
(116,'BET0047',1,'2020-12-29 09:49:10'),
(117,'BET0047',1,'2020-12-29 09:49:22'),
(118,'BET0047',1,'2020-12-29 09:50:46'),
(119,'',0,'2020-12-29 09:50:50'),
(120,'',1,'2020-12-29 09:51:00'),
(121,'',1,'2020-12-29 09:51:06'),
(122,'',1,'2020-12-29 09:51:28'),
(123,'',1,'2020-12-29 09:51:41'),
(124,'',1,'2020-12-29 09:52:15'),
(125,'',1,'2020-12-29 09:52:18'),
(126,'',1,'2020-12-29 09:52:26'),
(127,'',1,'2020-12-29 09:52:50'),
(128,'',1,'2020-12-29 09:53:46'),
(129,'',1,'2020-12-29 09:53:57'),
(130,'',1,'2020-12-29 09:54:07'),
(131,'',1,'2020-12-29 09:56:15'),
(132,'',1,'2020-12-29 09:56:22'),
(133,'',1,'2020-12-29 09:56:43'),
(134,'BET0047',1,'2020-12-29 09:57:20'),
(135,'BET0047',1,'2020-12-29 09:57:28'),
(136,'BET0047',1,'2020-12-29 09:57:44'),
(137,'BET0047',1,'2020-12-29 09:57:49'),
(138,'BET0047',1,'2020-12-29 09:58:05'),
(139,'BET0047',1,'2020-12-29 09:59:00'),
(140,'BET0047',1,'2020-12-29 10:00:03'),
(141,'BET0047',1,'2020-12-29 10:00:45'),
(142,'BET0047',1,'2020-12-29 10:01:43'),
(143,'BET0047',1,'2020-12-29 10:02:08'),
(144,'BET0047',1,'2020-12-29 10:02:56'),
(145,'',1,'2020-12-29 10:03:53'),
(146,'BET0047',1,'2020-12-29 10:04:19'),
(147,'BET0047',1,'2020-12-29 10:04:27'),
(148,'',0,'2020-12-29 10:04:32'),
(149,'BET0047',1,'2020-12-29 10:04:43'),
(150,'',0,'2020-12-29 10:05:41'),
(151,'BET0027',1,'2020-12-29 10:10:42'),
(152,'',0,'2020-12-29 10:10:48'),
(153,'',1,'2020-12-29 10:11:26'),
(154,'BET0027',1,'2020-12-29 10:16:28'),
(155,'',0,'2020-12-29 10:20:10'),
(156,'BET0047',1,'2020-12-29 10:20:24'),
(157,'',0,'2020-12-29 10:20:45'),
(158,'',1,'2020-12-29 10:20:53'),
(159,'ADMIN',1,'2020-12-29 10:21:18'),
(160,'ADMIN',0,'2020-12-29 10:22:20'),
(161,'ADMIN',1,'2020-12-29 10:22:27'),
(162,'ADMIN',0,'2020-12-29 10:23:22'),
(163,'BET0047',1,'2020-12-29 10:23:43'),
(164,'',0,'2020-12-29 10:28:32'),
(165,'ADMIN',1,'2020-12-29 10:28:44'),
(166,'ADMIN',0,'2020-12-29 10:32:57'),
(167,'BET0046',1,'2020-12-29 10:35:55'),
(168,'',0,'2020-12-29 10:36:01'),
(169,'BET0046',1,'2020-12-29 10:36:53'),
(170,'',0,'2020-12-29 10:36:56'),
(171,'BET0046',1,'2020-12-29 10:37:19'),
(172,'',0,'2020-12-29 10:45:44'),
(173,'BET0047',1,'2020-12-29 10:45:48'),
(174,'',0,'2020-12-29 10:45:56'),
(175,'ADMIN',1,'2020-12-29 10:46:07'),
(176,'BET0047',1,'2020-12-29 10:52:29'),
(177,'ADMIN',0,'2020-12-29 10:52:35'),
(178,'BET0047',1,'2020-12-29 13:24:56'),
(179,'',0,'2020-12-29 13:28:11'),
(180,'ADMIN',1,'2020-12-29 13:28:24'),
(181,'ADMIN',0,'2020-12-29 13:28:31'),
(182,'BET0047',1,'2020-12-29 13:28:40'),
(183,'ADMIN',1,'2020-12-29 14:38:34'),
(184,'ADMIN',0,'2020-12-29 14:38:36'),
(185,'ADMIN',1,'2020-12-29 14:38:41'),
(186,'',1,'2020-12-30 09:08:33'),
(187,'BET0047',1,'2020-12-30 09:11:17'),
(188,'',0,'2020-12-30 09:11:19'),
(189,'BET0047',1,'2020-12-30 14:41:24'),
(190,'',0,'2020-12-30 14:41:26'),
(191,'BTM0048',1,'2021-01-04 10:31:19'),
(192,'ASU0020',1,'2021-01-04 10:56:32'),
(193,'',0,'2021-01-04 10:56:46'),
(194,'BET0047',1,'2021-01-04 10:58:05'),
(195,'ADMIN',1,'2021-01-04 11:00:24'),
(196,'BET0047',1,'2021-01-04 11:40:53'),
(197,'BET0047',1,'2021-01-04 11:42:50'),
(198,'ASU0020',1,'2021-01-04 11:43:18'),
(199,'',0,'2021-01-04 11:48:18'),
(200,'ADMIN',1,'2021-01-04 11:48:29'),
(201,'ADMIN',1,'2021-01-04 14:10:47'),
(202,'ADMIN',0,'2021-01-04 14:14:14'),
(203,'BET0047',1,'2021-01-04 14:14:28'),
(204,'',0,'2021-01-04 14:17:39'),
(205,'ADMIN',1,'2021-01-04 14:18:31'),
(206,'BET0047',1,'2021-01-04 15:09:46'),
(207,'ADMIN',0,'2021-01-04 15:10:52'),
(208,'BET0047',1,'2021-01-04 15:11:38'),
(209,'BET0047',1,'2021-01-04 15:17:47'),
(210,'',0,'2021-01-04 15:20:38'),
(211,'',0,'2021-01-04 15:20:40'),
(212,'',0,'2021-01-04 15:20:46'),
(213,'ADMIN',1,'2021-01-04 15:27:28'),
(214,'ADMIN',0,'2021-01-04 15:27:50'),
(215,'ASU0020',1,'2021-01-04 21:46:19'),
(216,'ASU0020',1,'2021-01-04 21:48:46'),
(217,'ADMIN',1,'2021-01-05 09:15:58'),
(218,'BDP0008',1,'2021-01-05 10:18:18'),
(219,'BET0047',1,'2021-01-05 11:31:35'),
(220,'BES0093',1,'2021-01-05 16:11:31'),
(221,'ADMIN',0,'2021-01-05 16:12:56'),
(222,'BET0047',1,'2021-01-05 16:13:46'),
(223,'',0,'2021-01-05 16:14:01'),
(224,'ADMIN',1,'2021-01-05 16:14:12'),
(225,'BET0047',1,'2021-01-05 19:01:58'),
(226,'',0,'2021-01-05 19:02:39'),
(227,'BGA0117',1,'2021-01-06 08:48:46'),
(228,'ADMIN',1,'2021-01-06 09:04:43'),
(229,'BGA0072',1,'2021-01-06 10:01:00'),
(230,'BDC0006',1,'2021-01-06 10:11:11'),
(231,'ADMIN',1,'2021-01-06 10:14:01'),
(232,'ADMIN',1,'2021-01-06 12:45:45'),
(233,'ADMIN',0,'2021-01-06 13:57:40'),
(234,'ADMIN',1,'2021-01-06 13:57:58'),
(235,'ADMIN',1,'2021-01-06 14:32:08'),
(236,'BSS0135',1,'2021-01-06 14:57:33'),
(237,'BSS0125',1,'2021-01-06 16:01:44'),
(238,'BET0047',1,'2021-01-06 16:26:08'),
(239,'',0,'2021-01-06 16:30:24'),
(240,'ADMIN',1,'2021-01-06 16:30:33'),
(241,'ADMIN',0,'2021-01-06 16:35:29'),
(242,'ADMIN',1,'2021-01-06 16:35:38'),
(243,'ADMIN',0,'2021-01-06 16:36:21'),
(244,'ADMIN',1,'2021-01-06 16:36:47'),
(245,'ADMIN',0,'2021-01-06 16:38:00'),
(246,'ADMIN',1,'2021-01-06 16:38:27'),
(247,'ADMIN',1,'2021-01-07 09:30:42'),
(248,'ADMIN',1,'2021-01-07 09:30:42'),
(249,'APA0004',1,'2021-01-07 10:38:31'),
(250,'APA0004',1,'2021-01-07 10:42:07'),
(251,'BET0020',1,'2021-01-07 10:43:06'),
(252,'BET0020',1,'2021-01-07 10:43:43'),
(253,'ADMIN',1,'2021-01-07 10:54:17'),
(254,'ADMIN',1,'2021-01-07 12:03:23'),
(255,'ADMIN',1,'2021-01-07 12:07:45'),
(256,'ADMIN',1,'2021-01-07 13:49:22'),
(257,'ADMIN',1,'2021-01-07 15:05:10'),
(258,'ADMIN',1,'2021-01-11 13:18:45'),
(259,'ADMIN',1,'2021-01-12 08:46:02'),
(260,'ADMIN',1,'2021-01-12 11:44:19'),
(261,'ADMIN',1,'2021-01-12 11:43:35'),
(262,'ADMIN',1,'2021-01-12 11:44:58'),
(263,'ADMIN',1,'2021-01-12 11:46:51'),
(264,'ADMIN',1,'2021-01-12 12:26:36'),
(265,'ADMIN',1,'2021-01-12 12:51:13'),
(266,'ADMIN',1,'2021-01-12 13:17:05'),
(267,'ADMIN',1,'2021-01-12 13:18:02'),
(268,'',1,'2021-01-12 13:26:05'),
(269,'',1,'2021-01-12 13:26:09'),
(270,'ADMIN',1,'2021-01-12 13:26:18'),
(271,'',0,'2021-01-14 09:00:24'),
(272,'ADMIN',1,'2021-01-14 09:00:28'),
(273,'ADMIN',0,'2021-01-14 14:41:25'),
(274,'ADMIN',1,'2021-01-14 14:41:35'),
(275,'',0,'2021-01-15 09:17:05'),
(276,'ADMIN',1,'2021-01-15 09:17:11'),
(277,'',0,'2021-01-18 09:10:53'),
(278,'ADMIN',1,'2021-01-18 09:11:05'),
(279,'',0,'2021-01-20 11:17:00'),
(280,'ADMIN',1,'2021-01-20 11:17:06'),
(281,'',0,'2021-01-21 09:11:21'),
(282,'ADMIN',1,'2021-01-21 09:11:27'),
(283,'',0,'2021-01-21 13:10:17'),
(284,'',0,'2021-01-21 13:10:49'),
(285,'ADMIN',1,'2021-01-21 13:10:57'),
(286,'ADMIN',0,'2021-01-21 14:34:24'),
(287,'',1,'2021-01-21 14:34:29'),
(288,'',1,'2021-01-21 14:37:15'),
(289,'',1,'2021-01-21 14:42:01'),
(290,'BET0047',0,'2021-01-21 14:42:02'),
(291,'',1,'2021-01-21 14:42:15'),
(292,'BET0047',0,'2021-01-21 14:42:15'),
(293,'',0,'2021-01-22 08:52:26'),
(294,'ADMIN',1,'2021-01-22 08:52:31'),
(295,'ADMIN',0,'2021-01-22 08:52:46'),
(296,'',0,'2021-02-08 13:38:54'),
(297,'ADMIN',1,'2021-02-08 13:39:01'),
(298,'',0,'2021-03-09 09:10:34'),
(299,'ADMIN',1,'2022-01-20 09:13:37'),
(300,'BET0047',1,'2022-01-20 09:13:53'),
(301,'ADMIN',1,'2022-01-20 09:14:57'),
(302,'ADMIN',1,'2022-01-20 09:17:26'),
(303,'ADMIN',1,'2022-01-20 09:18:36'),
(304,'ADMIN',1,'2022-01-20 09:18:38'),
(305,'ADMIN',1,'2022-01-20 09:19:08'),
(306,'BET0047',1,'2022-01-20 09:20:23'),
(307,'BET0047',1,'2022-01-20 09:21:41'),
(308,'BET0047',1,'2022-01-20 09:22:29'),
(309,'BET0047',1,'2022-01-20 09:22:55'),
(310,'ADMIN',1,'2022-01-20 09:32:59'),
(311,'',1,'2022-01-20 09:33:33'),
(312,'ADMIN',1,'2022-01-20 09:33:45'),
(313,'ADMIN',1,'2022-01-20 09:34:33'),
(314,'ADMIN',1,'2022-01-20 09:38:11'),
(315,'ADMIN',1,'2022-01-20 09:38:24'),
(316,'ADMIN',1,'2022-01-20 09:38:53'),
(317,'ADMIN',1,'2022-01-20 09:39:45'),
(318,'ADMIN',1,'2022-01-20 09:40:08'),
(319,'ADMIN',1,'2022-01-20 09:40:39'),
(320,'ADMIN',1,'2022-01-20 09:40:51'),
(321,'BET0047',1,'2022-01-20 09:40:59'),
(322,'BET0047',1,'2022-01-20 09:41:17'),
(323,'BET0047',1,'2022-01-20 09:42:09'),
(324,'BET0047',1,'2022-01-20 09:42:33'),
(325,'ADMIN',1,'2022-01-20 09:43:39'),
(326,'ADMIN',1,'2022-01-20 10:46:04'),
(327,'ADMIN',1,'2022-01-20 13:12:58'),
(328,'ADMIN',1,'2022-01-21 09:18:00'),
(329,'BET0047',1,'2022-01-21 10:14:04'),
(330,'ADMIN',1,'2022-01-21 10:14:56'),
(331,'BET0047',1,'2022-01-21 10:16:39'),
(332,'BET0047',1,'2022-01-21 10:18:59'),
(333,'BET0047',1,'2022-01-21 10:19:35'),
(334,'BET0047',1,'2022-01-21 10:21:06'),
(335,'BET0047',1,'2022-01-21 10:25:50'),
(336,'BET0047',1,'2022-01-21 10:25:51'),
(337,'BET0047',1,'2022-01-21 10:26:36'),
(338,'BET0047',1,'2022-01-21 10:26:52'),
(339,'ASU0020',1,'2022-01-21 11:05:44'),
(340,'BET0047',1,'2022-01-21 11:07:06'),
(341,'ADMIN',1,'2022-01-21 14:16:16'),
(342,'BET0047',1,'2022-01-21 14:16:37'),
(343,'BET0047',1,'2022-01-21 16:08:01'),
(344,'ADMIN',1,'2022-01-24 08:54:49'),
(345,'ADMIN',1,'2022-01-24 08:55:07'),
(346,'BET0047',1,'2022-01-24 08:55:17'),
(347,'ADMIN',1,'2022-01-24 09:09:39'),
(348,'BET0047',1,'2022-01-24 09:11:00'),
(349,'BET0047',1,'2022-01-24 09:38:37'),
(350,'ADMIN',1,'2022-01-24 09:54:59'),
(351,'BET0047',1,'2022-01-24 09:55:20'),
(352,'BET0047',1,'2022-01-24 10:03:13'),
(353,'ASU0020',1,'2022-01-24 10:03:39'),
(354,'BET0047',1,'2022-01-24 10:06:47'),
(355,'ASU0020',1,'2022-01-24 10:09:52'),
(356,'BET0047',1,'2022-01-24 10:13:00'),
(357,'ASU0020',1,'2022-01-24 10:27:51'),
(358,'ADMIN',1,'2022-01-24 10:28:13'),
(359,'BET0047',1,'2022-01-24 10:28:31'),
(360,'ADMIN',1,'2022-01-24 10:29:29'),
(361,'BET0047',1,'2022-01-24 10:29:56'),
(362,'ADMIN',1,'2022-01-25 09:20:08'),
(363,'ADMIN',1,'2022-01-25 14:23:00'),
(364,'ADMIN',1,'2022-01-26 10:10:53'),
(365,'ADMIN',1,'2022-01-27 09:09:42'),
(366,'ADMIN',1,'2022-01-27 14:49:34'),
(367,'BET0047',1,'2022-01-27 15:19:21'),
(368,'ADMIN',1,'2022-01-27 15:21:10'),
(369,'ADMIN',1,'2022-01-28 09:25:04'),
(370,'ADMIN',1,'2022-01-28 13:06:10'),
(371,'ADMIN',1,'2022-02-02 08:46:25'),
(372,'ADMIN',1,'2022-02-02 09:25:18'),
(373,'ADMIN',1,'2022-12-27 10:34:57'),
(374,'ADMIN',1,'2022-12-27 10:48:34'),
(375,'ADMIN',1,'2023-01-03 11:44:12'),
(376,'ADMIN',1,'2023-01-06 08:47:48'),
(377,'BET0047',1,'2023-01-06 10:58:04'),
(378,'ADMIN',1,'2023-01-09 09:37:15'),
(379,'ADMIN',1,'2023-01-09 09:40:29'),
(380,'ADMIN',1,'2023-01-09 09:57:45'),
(381,'BET0047',1,'2023-01-09 09:59:27'),
(382,'BET0047',1,'2023-01-09 10:01:02'),
(383,'ASU0020',1,'2023-01-09 10:05:21'),
(384,'BET0047',1,'2023-01-09 10:28:30'),
(385,'ASU0020',1,'2023-01-09 10:32:12'),
(386,'ADMIN',1,'2023-01-10 09:07:55'),
(387,'ASU0020',1,'2023-01-10 10:48:22'),
(388,'ADMIN',1,'2023-01-10 13:04:01'),
(389,'ASU0020',1,'2023-01-10 13:15:53'),
(390,'BET0047',1,'2023-01-10 13:18:06'),
(391,'BET0047',1,'2023-01-10 14:10:07'),
(392,'ASU0020',1,'2023-01-10 14:12:34'),
(393,'ASU0020',1,'2023-01-10 14:35:27'),
(394,'ASU0020',1,'2023-01-10 14:38:44'),
(395,'ADMIN',1,'2023-01-10 14:55:17'),
(396,'ADMIN',0,'2023-01-10 16:16:53'),
(397,'ADMIN',1,'2023-01-11 10:29:04'),
(398,'ADMIN',1,'2023-01-11 10:50:11');

/*Table structure for table `option` */

DROP TABLE IF EXISTS `option`;

CREATE TABLE `option` (
  `title` varchar(255) DEFAULT NULL,
  `logo` longtext,
  `created` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated` datetime DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/*Data for the table `option` */

insert  into `option`(`title`,`logo`,`created`,`updated`) values 
('Faculty Of Medicine',NULL,'2023-01-09 09:56:06','2023-01-09 09:56:06');

/*Table structure for table `reservation` */

DROP TABLE IF EXISTS `reservation`;

CREATE TABLE `reservation` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'ไอดี รายการจองห้อง',
  `room_id` int(11) NOT NULL COMMENT 'ไอดี ห้อง',
  `member_id` varchar(13) COLLATE utf8_unicode_ci NOT NULL COMMENT 'รหัสเจ้าหน้าที่ผู้จอง',
  `fullname_res` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'วันสร้างคำขอ',
  `topic` varchar(150) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'หัวข้อการจอง',
  `comment` text COLLATE utf8_unicode_ci COMMENT 'รายละเอียดเพิ่มเติม',
  `begin` datetime DEFAULT NULL COMMENT 'วัน เวลา เริ่มต้น',
  `end` datetime DEFAULT NULL COMMENT 'วัน เวลา สิ้นสุด',
  `status` int(11) NOT NULL DEFAULT '0' COMMENT '0 = รอตรวจสอบ, 1 = อนุญาติ, 2 = ยกเลิก',
  `phone` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `for` varchar(128) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ใช้สำหรับ',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `reservation` */

/*Table structure for table `rooms` */

DROP TABLE IF EXISTS `rooms`;

CREATE TABLE `rooms` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `create_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `name` varchar(150) COLLATE utf8_unicode_ci NOT NULL COMMENT 'ชื่อห้อง',
  `building_id` int(11) DEFAULT NULL COMMENT 'ตึก',
  `class_no` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL COMMENT 'ชั้น',
  `detail` text COLLATE utf8_unicode_ci NOT NULL COMMENT 'รายละเอียดห้อง',
  `published` int(11) NOT NULL DEFAULT '1',
  `date_edit` datetime DEFAULT CURRENT_TIMESTAMP,
  `use_for` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `privacy` varchar(255) COLLATE utf8_unicode_ci DEFAULT '1' COMMENT '1 = public , medcode = หน่วยงาน',
  `admin_section` varchar(2) COLLATE utf8_unicode_ci NOT NULL,
  `admin_phone` varchar(10) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=30 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `rooms` */

insert  into `rooms`(`id`,`create_date`,`name`,`building_id`,`class_no`,`detail`,`published`,`date_edit`,`use_for`,`privacy`,`admin_section`,`admin_phone`) values 
(22,'2023-01-10 15:37:36','Conference Room',1,'6','บรรจุได้ประมาณ 20-30 คน',1,'2023-01-10 15:37:36','3,6,7','1','54','9687'),
(23,'2023-01-10 15:39:00','ห้องบันทึกการเรียนการสอน 1',1,'6','บรรจุได้  1 คน ใช้สำหรับสอนหรือบันทึกการเรียนการสอนออนไลน์',1,'2023-01-10 15:39:00','7','1','54','9687'),
(21,'2023-01-10 15:36:25','Computer Room 2',1,'6','ไม่มีคอมพิวเตอร์ ใช้สำหรับ จัดประชุม จัดสัมนา เรียน บรรจุได้ประมาณ 30-40 คน',1,'2023-01-10 15:36:25','3,6,7','1','54','9687'),
(19,'2023-01-10 15:34:36','Smart Classroom',1,'6','บรรจุได้ประมาณ 45 คน',1,'2023-01-10 15:34:36','3,6,7','1','54','9687'),
(20,'2023-01-10 15:35:18','Computer Room 1',1,'6','มีคอมพิวเตอร์พร้อมใช้ 30 เครื่อง',1,'2023-01-10 15:35:18','3,6,7','1','54','9687'),
(24,'2023-01-10 15:39:26','ห้องบันทึกการเรียนการสอน 2',1,'6','บรรจุได้ 1 คน ใช้สำหรับบันทึกและสอนออนไลน์',1,'2023-01-10 15:39:26','7','1','54','9687'),
(25,'2023-01-10 15:39:56','ห้องบันทึกการเรียนการสอน 3',1,'6','บรรจุได้ 1 คน ใช้สำหรับบันทึกและสอนออนไลน์',1,'2023-01-10 15:39:56','7','1','54','9687'),
(26,'2023-01-10 15:40:19','ห้องบันทึกการเรียนการสอน 4',1,'6','บรรจุได้ 1 คน ใช้สำหรับบันทึกและสอนออนไลน์',1,'2023-01-10 15:40:19','7','1','54','9687'),
(27,'2023-01-10 15:48:19','ห้องอัดเสียง',1,'6','',1,'2023-01-10 15:48:19','9','1','54','9687'),
(28,'2023-01-10 15:48:40','ห้องถ่ายภาพ',1,'6','',1,'2023-01-10 15:48:40','10','1','54','9687'),
(29,'2023-01-10 15:50:04','ห้องประชุมงานเทคโนฯ',1,'6','บรรจุได้ประมาณ 30 คน',1,'2023-01-10 15:50:04','3,6,7,11,12','1','54','9687');

/*Table structure for table `users` */

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `password` varchar(50) COLLATE utf8_unicode_ci NOT NULL,
  `TFNAME` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `TLNAME` varchar(150) COLLATE utf8_unicode_ci NOT NULL,
  `sex` varchar(50) COLLATE utf8_unicode_ci DEFAULT NULL,
  `id_card` varchar(13) COLLATE utf8_unicode_ci DEFAULT NULL,
  `session_id` varchar(32) COLLATE utf8_unicode_ci DEFAULT NULL,
  `create_date` datetime DEFAULT CURRENT_TIMESTAMP,
  `active` tinyint(1) DEFAULT '1',
  `status_type` int(11) DEFAULT '0' COMMENT '0 = ผู้ใช้ , 1 = Admin',
  PRIMARY KEY (`id`),
  KEY `username` (`username`)
) ENGINE=MyISAM AUTO_INCREMENT=26 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `users` */

insert  into `users`(`id`,`username`,`password`,`TFNAME`,`TLNAME`,`sex`,`id_card`,`session_id`,`create_date`,`active`,`status_type`) values 
(22,'ADMIN','1a1dc91c907325c69271ddf0c944bc72','ผู้ดูแลระบบ','admin','ชาย','1111111111111',NULL,'2020-12-23 14:02:23',1,1);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
